Revit 2027 API
StructuralSectionIWideFlange.BoltDiameter Property
 Maximum bolt hole diameter, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltDiameter { get; set; }
Public Property BoltDiameter As Double
	Get
	Set
public:
property double BoltDiameter {
	double get ();
	void set (double value);
}
member BoltDiameter : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace